Revit 2017 API
ApplicationEntryPoint Events
The ApplicationEntryPoint type exposes the following members.
Events
Name | Description
ApplicationClosing
 Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.
 (Inherited from UIApplication.)
DialogBoxShowing
 Subscribe to the DialogBoxShowing event to be notified when Revit is just about to show a dialog box or a message box.
 (Inherited from UIApplication.)
DisplayingOptionsDialog
 Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying.
 (Inherited from UIApplication.)
DockableFrameFocusChanged
 Subscribe to this event to be notified when a Revit GenericDockableFrame has gained focus or lost focus in the Revit user interface. This event is called only for API-created GenericDockableFrames.
 (Inherited from UIApplication.)
DockableFrameVisibilityChanged
 Subscribe to this event to be notified when a Revit GenericDockableFrame has been shown or hidden in the Revit user interface. This event is called only for API-created GenericDockableFrames.
 (Inherited from UIApplication.)
FabricationPartBrowserChanged
 Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.
 (Inherited from UIApplication.)
Idling
 Subscribe to the Idling event to be notified when Revit is not in an active tool or transaction.
 (Inherited from UIApplication.)
ViewActivated
 Subscribe to the ViewActivated event to be notified immediately after Revit has finished activating a view of a document.
 (Inherited from UIApplication.)
ViewActivating
 Subscribe to the ViewActivating event to be notified when Revit is just about to activate a view of a document.
 (Inherited from UIApplication.)
See Also
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace